-- MySQL dump 10.13  Distrib 8.4.5, for Win64 (x86_64)
--
-- Host: localhost    Database: halchinemadb
-- ------------------------------------------------------
-- Server version	8.4.5

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `movies`
--

DROP TABLE IF EXISTS `movies`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `movies` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(64) NOT NULL,
  `release_date` date DEFAULT NULL,
  `end_date` date DEFAULT NULL,
  `running_time` int DEFAULT NULL,
  `viewers` int unsigned DEFAULT NULL,
  `synopsis` text,
  `image_url` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `movies`
--

LOCK TABLES `movies` WRITE;
/*!40000 ALTER TABLE `movies` DISABLE KEYS */;
INSERT INTO `movies` VALUES (1,'映画1','2025-05-19','2025-06-30',120,15000,'これは映画1のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:47:59'),(2,'映画2','2025-05-19','2025-06-30',105,12000,'これは映画2のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:47:59'),(3,'映画3','2025-05-19','2025-06-30',98,18000,'これは映画3のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:47:59'),(4,'映画4','2025-05-19','2025-06-30',135,9500,'これは映画4のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:47:59'),(5,'映画5','2025-05-19','2025-06-30',110,21000,'これは映画5のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:47:59'),(6,'映画6','2025-05-19','2025-06-30',100,14000,'これは映画6のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:47:59'),(7,'映画7','2025-05-19','2025-06-30',115,16500,'これは映画7のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:47:59'),(8,'映画8','2025-05-19','2025-06-30',90,11000,'これは映画8のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:47:59'),(9,'映画9','2025-05-19','2025-06-30',125,19000,'これは映画9のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:47:59'),(10,'映画10','2025-05-19','2025-06-30',108,13000,'これは映画10のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:47:59'),(11,'映画11','2025-08-16','2025-10-09',130,17500,'これは映画11のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:46:12'),(12,'映画12','2025-08-06','2025-10-16',95,10000,'これは映画12のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:46:12'),(13,'映画13','2025-08-10','2025-10-23',122,20000,'これは映画13のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:46:12'),(14,'映画14','2025-08-30','2025-10-30',102,14500,'これは映画14のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:46:12'),(15,'映画15','2025-08-28','2025-11-06',118,15500,'これは映画15のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:46:12'),(16,'映画16','2025-08-20','2025-11-13',107,11500,'これは映画16のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:46:12'),(17,'映画17','2025-08-16','2025-11-20',138,19500,'これは映画17のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:46:12'),(18,'映画18','2025-08-20','2025-11-27',93,12500,'これは映画18のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:46:12'),(19,'映画19','2025-08-20','2025-12-04',112,17000,'これは映画19のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:46:12'),(20,'映画20','2025-08-10','2025-12-11',103,13500,'これは映画20のあらすじです。','320.jpg','2025-05-21 07:09:29','2025-05-21 07:46:12'),(21,'公開終了映画1','2025-01-15','2025-02-28',120,150000,'公開終了した映画1のあらすじ','320.jpg','2025-05-21 07:52:35','2025-05-21 07:52:35'),(22,'公開終了映画2','2024-12-01','2025-01-31',110,120000,'公開終了した映画2のあらすじ','320.jpg','2025-05-21 07:52:35','2025-05-21 07:52:35'),(23,'公開終了映画3','2025-02-01','2025-03-15',95,180000,'公開終了した映画3のあらすじ','320.jpg','2025-05-21 07:52:35','2025-05-21 07:52:35'),(24,'公開終了映画4','2024-11-01','2024-12-31',135,200000,'公開終了した映画4のあらすじ','320.jpg','2025-05-21 07:52:35','2025-05-21 07:52:35'),(25,'公開終了映画5','2025-03-01','2025-04-30',100,110000,'公開終了した映画5のあらすじ','320.jpg','2025-05-21 07:52:35','2025-05-21 07:52:35'),(26,'公開終了映画6','2024-10-15','2024-11-30',105,160000,'公開終了した映画6のあらすじ','320.jpg','2025-05-21 07:52:35','2025-05-21 07:52:35'),(27,'公開終了映画7','2025-01-01','2025-02-20',115,130000,'公開終了した映画7のあらすじ','320.jpg','2025-05-21 07:52:35','2025-05-21 07:52:35'),(28,'公開終了映画8','2024-09-01','2024-10-31',125,190000,'公開終了した映画8のあらすじ','320.jpg','2025-05-21 07:52:35','2025-05-21 07:52:35'),(29,'公開終了映画9','2025-02-15','2025-03-31',90,140000,'公開終了した映画9のあらすじ','320.jpg','2025-05-21 07:52:35','2025-05-21 07:52:35'),(30,'公開終了映画10','2024-12-15','2025-01-15',130,170000,'公開終了した映画10のあらすじ','320.jpg','2025-05-21 07:52:35','2025-05-21 07:52:35');
/*!40000 ALTER TABLE `movies` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-05-21 17:14:05
